Revit 2027 API
BuiltInFailures.RoomFailures.RoomUnplaceWarning Property
 A Room was deleted from all model views but still remains in this project. \n The room can be removed from any schedule or placed back in the model using the Room command.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomUnplaceWarning { get; }
Public Shared ReadOnly Property RoomUnplaceWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomUnplaceWarning {
	FailureDefinitionId^ get ();
}
static member RoomUnplaceWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace